Revit 2024 API
FabricationConfigurationInfo.IsValid Method
 Checks if the fabrication configuration is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if the fabrication configuration is valid.
See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace